_site/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ashwin"], ["text", "Jaaga"], ["created_at", "2015-03-18 07:13:45.493560"], ["updated_at", "2015-03-18 07:13:45.493560"]]
---
	def create
		# render plain: params[:article].inspect
		@article = Article.new(article_params)

		if @article.save